{
  "Haar wavelet-based adaptive finite volume shallow water solver (Haleem, Dilshad A. Kesserwani etc.).pdf": {
    "hash": "1740127940.659023",
    "summarised_date": "2025-03-18T14:06:46.665682",
    "num_chunks": 26,
    "summary": " The document \"Haar wavelet-based adaptive finite volume shallow water solver\" presents a new adaptive multiresolution scheme for simulating shallow water flows, referred to as Haar wavelets finite volume (HWFV) method. This approach combines the Haar wavelet basis with the finite volume (FV) method to enable adaptive mesh refinement based on solution-driven resolution adaptation using a single threshold value ε.\n\nThe document begins by providing background information on shallow water equations and the FV method, followed by an overview of multiresolution analysis and its mathematical properties using Haar wavelets. The authors then describe how they implemented this concept within the HWFV SWE numerical solver and discuss the performance benefits, addressing issues related to adaptivity parameterizations, modelling of irregular topography with/without wetting and drying, accuracy preservation, and mesh convergence.\n\nNumerical tests are performed on various test cases to evaluate the proposed method's ability to solve the one-dimensional (1D) shallow water equations, address issues related to adaptivity, modelling of irregular topography, and ensure accurate results with good balance properties. The document also mentions some comparisons with relative CPU time for parabolic bowl flow simulations using different threshold values.\n\nFurther research plans include integrating the friction source term in a well-balanced manner, exploring sensitivity issues related to increasing resolution levels with varying threshold values, and extending the approach to two dimensions. The document acknowledges support from various funding sources.",
    "summary_type": "FULL"
  },
  "Flood protection with dams and flood control reservoirs—before and after the extreme flood event of August 2002, Saxony (Müller, Uwe).pdf": {
    "hash": "1739178493.6097765",
    "summarised_date": "2025-03-18T14:08:15.299135",
    "num_chunks": 12,
    "summary": " The document \"Flood protection with dams and flood control reservoirs—before and after the extreme flood event of August 2002, Saxony (Mueller, Uwe).pdf\" discusses the flood design and effects of dams and flood control reservoirs in the German state of Saxony before and after the extreme flood event that occurred in August 2002. The author, Uwe Mueller, is the Head of Department for Water and Waste at the Saxon State Agency for Environment, Agriculture and Geology.\n\nThe document begins by discussing the methods used to assess the potential impact of floods on dams and reservoirs in Saxony. This included using regionalized time series based on KOZENY and rainfall–runoff models for ungauged regions. The design rainfalls were assumed to have a comparable recurrence interval with precipitation events.\n\nThe paper then moves on to discuss the effects of the August 2002 floods on dams and reservoirs in Saxony. It was noted that the largest core area precipitation event ever recorded in Germany occurred during this event, leading to exceptionally high peak floods and volumes with very high runoff coefficients. The flooding affected the Weißeritz and Muğlitz areas, where the flood return period was estimated to be between 200 and 500 years.\n\nAt the onset of the floods, there was a total normal flood retention volume of approximately 122.5 Mm3 available in the LTV reservoirs, with additional storage volume available at some dams due to low inflows before the event. The document provides several examples of how appropriate reservoir management could delay and reduce flood peaks and flows.\n\nAfter the floods, new feasibility studies were conducted for new flood retention basins to improve the effectiveness of flood protection measures. Three months after the floods, a Saxony-wide campaign was initiated to identify possible locations for flood retention basins, considering settlements, infrastructure, and other factors to avoid overloading the model.\n\nThe document concludes by providing references to earlier articles on the topic and internal reports from the LTV. It also mentions that it is optimistically estimated that by 2013, 13 new flood retention basins will be realized in Saxony.",
    "summary_type": "FULL"
  },
  "Climatic Variation and Observed Changes in the General Circulation (H. H. Lamb and A. I. Johnson).pdf": {
    "hash": "1739129973.892028",
    "summarised_date": "2025-03-18T14:11:03.326621",
    "num_chunks": 80,
    "summary": " \"Climatic Variation and Observed Changes in the General Circulation\" is a scientific paper written by H. H. Lamb and A. I. Johnson, published in 1956. The paper discusses climatic variations and observed changes in the Earth's atmosphere based on pressure maps and long-term observations.\n\nThe authors begin by surveying existing knowledge and theoretical interpretations of factors involved in climatic changes. They then describe an investigation they conducted using monthly mean pressure maps to gain a unified view of atmospheric circulation patterns and climate changes. Pressure maps reveal the atmospheric circulation pattern, which is the mechanism of climate and of day-to-day changes. The authors argue that atmospheric pressure has been neglected in the study of climatic fluctuations despite careful observation by early meteorologists.\n\nThe paper discusses several types of climatic variations and changes:\n\n1. Cyclic variations: Some variations have various (so far indeterminate) periods of the order of 20 to 70 years, and some of these oscillations probably are set up entirely within the Earth-atmosphere system.\n2. Solar influences: Climatic changes may also be influenced by the rotation period of the sun, the circulation of the world's oceans, and the atmospheres of the Earth and sun.\n3. Internal economy changes: Some climatic changes are provoked by changes in the internal economy of the Earth-atmosphere system without any change in external circumstances.\n4. Controversial causes: The authors remind readers not to let controversy about the prime cause of ice ages obscure the fact that climatic changes are polycausal.\n\nThe authors examine trends in the 40-year means of pressure anomalies and related curves, including actual pressure and pressure gradient at selected points in individual years. They also use lag correlations from January to January and compare the mean value and variance of pressure at key stations for different samples of 20 successive years. Their findings suggest that some regions, like the North Atlantic, have experienced significant changes in atmospheric pressure over time.\n\nThe document acknowledges contributions from various researchers and meteorological services, including Dr. Andrew Thomson, Dr. Amorim Ferreira, Dr. T. Hesselberg, Dr. Sigurdur Thorarinsson, Dr. David M. Ludlum, Professor Manley, and Dr. D. J. Schove, among others. The authors also thank the Director-General of the Meteorological Office in London for permission to publish their work.\n\nIn summary, the paper presents a historical overview of climatic variations and observed changes in the Earth's atmosphere based on pressure maps and long-term observations. It discusses various factors contributing to these changes, including solar influences, internal economy changes, and controversial causes, while also presenting findings from an investigation using monthly mean pressure maps.",
    "summary_type": "FULL"
  }
}